KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcu/Inc/Reg_eSys_PMC.h
#if (IPV_PMC == IPV_PMC_00_00_01_20)

    /* PMC - Supply Status Register. */
    #define PMC_SSR_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x00000000U))
    /* PMC - Control Register. */
    #define PMC_CR_ADDR32                       ((uint32)(PMC_BASEADDR + (uint32)0x00000004U))
    /* PMC - Reset Event Enable. */
    #define PMC_REE_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x00000008U))
    /* PMC - Fault Event Enable. */
    #define PMC_FEE_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x0000000CU))
    /* PMC - Interrupt Event Enable. */
    #define PMC_IEE_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x00000010U))
#endif

#if (IPV_PMC == IPV_PMC_00_00_00_15)

    /* PMC - Interrupt Enable Register. */
    #define PMC_TS_IER_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00000088U))
    /* PMC - Temperature Event Status Register. */
    #define PMC_ESR_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x0000008CU))
    /* PMC - Temperature Reset Event Enable Register. */
    #define PMC_REE_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00000090U))
    /* PMC - Temperature Reset Event Selection Register. */
    #define PMC_RES_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00000094U))
    /* PMC - Temperature Detector Configuration Register. */
    #define PMC_CTL_TD_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x00000098U))
    /* PMC - Temperature Sensor Fault Injection Register. */
    #define PMC_TS_FIR_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x000000A4U))
    /* PMC - Voltage Detect User Mode Test Register. */
    #define PMC_SELF_TEST_UM_VD_REG_ADDR32      ((uint32)(PMC_BASEADDR + (uint32)0x000000B4U))
    /* PMC - FCCU Fault Injection Register. */
    #define PMC_FIR_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x000000B8U))
    /* PMC - LVD/HVD Interrupt Enable Control Register. */
    #define PMC_LVD_HVD_INTR_ENB_ADDR32         ((uint32)(PMC_BASEADDR + (uint32)0x000000BCU))
    /* PMC - LVD/HVD Event Status Register. */
    #define PMC_LVD_HVD_EVENT_STATUS_ADDR32     ((uint32)(PMC_BASEADDR + (uint32)0x000000C0U))
    /* PMC - ADC Channel Select Register. */
    #define PMC_ADC_CS_ADDR32                   ((uint32)(PMC_BASEADDR + (uint32)0x000000C4U))
    /* PMC - LVD/HVD Event Status Register. */
    #define PMC_REE_ADDR32                      ((uint32)(PMC_BASEADDR + (uint32)0x000000D0U))
#endif


/***************************************************************************************************/
/***                                        PMC BitFields                                        ***/
/***************************************************************************************************/

#if (IPV_PMC == IPV_PMC_01_00_02_05)

    /***                  PMC_MCR              ***/
    #define PMC_MCR_RWBITS_MASK32                   ((uint32)0xFCFD0000U)
    #define PMC_MCR_RESBITS_MASK32                  ((uint32)0x00000000U)

    #define PMC_MCR_LVRER_MASK32                    ((uint32)0x80000000U)
    #define PMC_MCR_LVREH_MASK32                    ((uint32)0x40000000U)
    #define PMC_MCR_LVRE50_MASK32                   ((uint32)0x20000000U)
    #define PMC_MCR_LVRE33_MASK32                   ((uint32)0x10000000U)
    #define PMC_MCR_LVREC_MASK32                    ((uint32)0x08000000U)
    #define PMC_MCR_LVREA_MASK32                    ((uint32)0x04000000U)
    #define PMC_MCR_LVIER_MASK32                    ((uint32)0x00800000U)
    #define PMC_MCR_LVIEH_MASK32                    ((uint32)0x00400000U)
    #define PMC_MCR_LVIE50_MASK32                   ((uint32)0x00200000U)
    #define PMC_MCR_LVIE33_MASK32                   ((uint32)0x00100000U)
    #define PMC_MCR_LVIEC_MASK32                    ((uint32)0x00080000U)
    #define PMC_MCR_LVIEA_MASK32                    ((uint32)0x00040000U)
    #define PMC_MCR_TLK_MASK32                      ((uint32)0x00010000U)

    #define PMC_MCR_LVIE_MASK32                     ((uint32)0x00FC0000U)


    /***                 PMC_TRIMR              ***/
    #define PMC_TRIMR_RWBITS_MASK32                 ((uint32)0x00FFFFFFU)
    #define PMC_TRIMR_RESBITS_MASK32                ((uint32)0x00000000U)

    #define PMC_TRIMR_LVDATRIM_MASK32               ((uint32)0x00F00000U)
    #define PMC_TRIMR_LVDREGTRIM_MASK32             ((uint32)0x000F0000U)
    #define PMC_TRIMR_VDD33TRIM_MASK32              ((uint32)0x0000F000U)
    #define PMC_TRIMR_LVD33TRIM_MASK32              ((uint32)0x00000F00U)
    #define PMC_TRIMR_VDDCTRIM_MASK32               ((uint32)0x000000F0U)
    #define PMC_TRIMR_LVDCTRIM_MASK32               ((uint32)0x0000000FU)

    #define PMC_TRIMR_LVDATRIM_SHIFT32              ((uint32)0x00000014U)
    #define PMC_TRIMR_LVDREGTRIM_SHIFT32            ((uint32)0x00000010U)
    #define PMC_TRIMR_VDD33TRIM_SHIFT32             ((uint32)0x0000000CU)
    #define PMC_TRIMR_LVD33TRIM_SHIFT32             ((uint32)0x00000008U)
    #define PMC_TRIMR_VDDCTRIM_SHIFT32              ((uint32)0x00000004U)
    #define PMC_TRIMR_LVDCTRIM_SHIFT32              ((uint32)0x00000000U)


    /***                  PMC_SR              ***/
    #define PMC_SR_RWBITS_MASK32                    ((uint32)0x0004FC00U)
    #define PMC_SR_RESBITS_MASK32                   ((uint32)0x02000000U)

    #define PMC_SR_LVFSTBY_MASK32                   ((uint32)0x80000000U)
    #define PMC_SR_BGRDY_MASK32                     ((uint32)0x40000000U)
    #define PMC_SR_BGTS_MASK32                      ((uint32)0x20000000U)
    #define PMC_SR_LVFCSTBY_MASK32                  ((uint32)0x10000000U)
    #define PMC_SR_LVFCR_MASK32                     ((uint32)0x08000000U)
    #define PMC_SR_LVFCH_MASK32                     ((uint32)0x04000000U)
    #define PMC_SR_LVFC50_MASK32                    ((uint32)0x00000000U)
    #define PMC_SR_LVFC33_MASK32                    ((uint32)0x00000000U)
    #define PMC_SR_LVFCC_MASK32                     ((uint32)0x00000000U)
    #define PMC_SR_LVFCA_MASK32                     ((uint32)0x00000000U)
    #define PMC_SR_LVFR_MASK32                      ((uint32)0x00000000U)
    #define PMC_SR_LVFH_MASK32                      ((uint32)0x00000000U)
    #define PMC_SR_LVF50_MASK32                     ((uint32)0x00000000U)
    #define PMC_SR_LVF33_MASK32                     ((uint32)0x00000000U)
    #define PMC_SR_LVFC_MASK32                      ((uint32)0x00000000U)
    #define PMC_SR_LVFA_MASK32                      ((uint32)0x00000000U)

